#

grepなし--------------------------------------------------------------------------------------------------------

find `pwd` -maxdepth 6 -name "14522E-001-im-01_d2.eps" 1>>info.txt

grepあり--------------------------------------------------------------------------------------------------------

find `pwd` -maxdepth 6 -name "14522E-001-im-01_d2.eps" | xargs grep -m 1 "14522E-001-im-01_d2.eps" 1>>info.txt

---------------------------------------------------------------------------------------------------------------



cp A /Users/cips/Desktop/練習


grepなし--------------------------------------------------------------------------------------------------------

A=(
14522E-002-im-04_d2.eps
14522E-001-im-01_d2.eps
)

for i in `seq 3`
do

find `pwd` -maxdepth 6 -name "${A[i]}" -quit 1>>info.txt

done

---------------------------------------------------------------------------------------------------------------

cd '/Volumes/backup2022/bellemaison/N&S'

A=(
14522E-002-im-04_d2.eps
14522E-001-im-01_d2.eps
)

for i in `seq 3`
do
find `pwd` -maxdepth 6 -name "${A[i]}" | xargs grep -m 1 "${A[i]}" 1>>info.txt
done

---------------------------------------------------------------------------------------------------------------

B==$(<info.txt)

for i in `seq 3`
do
cp -a "${B[i]}" /Users/cips/Desktop/練習
done

---------------------------------------------------------------------------------------------------------------

変数テキスト--------------------------------------------------------------------------------------------------------

B=(
'/Volumes/backup2022/bellemaison/N&S/145-2022E_N&S22盛夏/inddCC2019_X7/002-003/Links_002/14522E-002-im-04_d2.eps'
'/Volumes/backup2022/bellemaison/N&S/145-2022E_N&S22盛夏/inddCC2019_X7/001m/Links_001/14522E-001-im-01_d2.eps'
)
for i in `seq 3`
do
cp -a "${B[i]}" /Users/cips/Desktop/練習
done

---------------------------------------------------------------------------------------------------------------

sed -i -e "s/置換したい文字列/置換後の文字列/g" [置換するファイル]


sed -i -e "s/Binary file /'/g" info.txt


変数テキスト化-------------------------------------------------------------------------------------

TEST=$(<test.txt)

while IFS= read -r B
   
for i in `seq 3`
do
cp -a "${B[i]}" /Users/cips/Desktop/練習
done < info.txt


最新のファイルのみ取得

ls -Rrt -1F `pwd`/* | tail -n 1

ls -Rrt -1F `pwd`/* | grep -v "/" 

ls -Rrt -1F -d $(find `pwd`) | grep -v "/"


絶対パス/

ls -d $(find `pwd`) 


変数テキスト化-------------------------------------------------------------------------------------

ls 2> /dev/null -d -Rrt -1F $(find `pwd`) | grep 8052106-池利めんつゆA_2106_d2.eps




#'abc'を含む行を出力する
$ grep 'abc' test_01.txt
#OR
$ grep "abc" test_01.txt
#OR




cat test.txt | grep '3502202-016-01-02_d2.eps' 


----------------------------------------------------------------------------------------------------------------------

B=(
14522E-001-im-01_d2.eps
)

for i in `seq 1`
do
cat test.txt | grep "${B[I]}"
done 1>>info.txt
 

----------------------------------------------------------------------------------------------------------------------

B==$(<info.txt)

for i in `seq 3`
do
cp -a "${B[i]}" /Users/cips/Desktop/練習
done




cp -a /Volumes/backup2022/bellemaison/スポーツ/350-202202_スポーツ22年02月チラシ/inddCC2019_X6/001-016/Links_001/3502202-001-01-01-0219_d2合成.eps /Users/cips/Desktop/練習

----------------------------------------------------------------------------------------------------------------------

B=(
14522E-001-im-01_d2.eps
14522B-004-im-01_d2.eps
14522B-004-im-02_d2.eps
)
for i in `seq 3`
do
ls 2> /dev/null -d -Rrt -1F $(find `pwd`) | grep "${B[i]}"
done

1>>info.txt
